<details><summary>Digger run report at 2023-10-13 12:41:47 (UTC)</summary>
          <details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

available_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
  "us-east-1d",
  "us-east-1e",
  "us-east-1f",
])
first_3_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])

  ```
</details>

<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_ecr</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_ecr_repository.this[0]: Refreshing state... [id=app-staging]
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1155861060]
aws_ecr_repository_policy.this[0]: Refreshing state... [id=app-staging]
aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=app-staging]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

repository_arn = "arn:aws:ecr:us-east-1:039454511521:repository/app-staging"
repository_registry_id = "039454511521"
repository_url = "039454511521.dkr.ecr.us-east-1.amazonaws.com/app-staging"

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
module.kms.data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
module.kms.data.aws_partition.current: Reading...
aws_security_group.cluster[0]: Refreshing state... [id=sg-044f16c76d3782fcb]
data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
aws_security_group.node[0]: Refreshing state... [id=sg-073f0eb34900457c7]
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001]
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1482041025]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1022825738]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4270708759]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2896772303]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-962315318]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2472210277]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-799746347]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2634311641]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3874049725]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1609955449]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3447937206]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114408036800000006]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114407847600000005]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114408081400000007]
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-20231013114408448900000009]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-20231013114408446300000008]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3908358093]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=cb43c7ab-6fba-48c1-8412-8704afe15168]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101311443417330000000a]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-2023101311443478930000000b]
time_sleep.this[0]: Refreshing state... [id=2023-10-13T11:53:53Z]
data.tls_certificate.this[0]: Reading...
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-0fc60012693b497ae,Terraform]
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0fc60012693b497ae,Environment]
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-08c198930bd9c71ac]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101311535584640000000e]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Warning: Argument is deprecated

  with aws_eks_addon.this["kube-proxy"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 2 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

aws_auth_configmap_yaml = <<EOT
apiVersion: v1
kind: ConfigMap
metadata:
  name: aws-auth
  namespace: kube-system
data:
  mapRoles: |
    - rolearn: arn:aws:iam::039454511521:role/general-eks-node-group-20231013114406218900000003
      username: system:node:{{EC2PrivateDNSName}}
      groups:
        - system:bootstrappers
        - system:nodes

EOT
cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:039454511521:log-group:/aws/eks/eks-staging/cluster"
cloudwatch_log_group_name = "/aws/eks/eks-staging/cluster"
cluster_addons = {
  "coredns" = {
    "addon_name" = "coredns"
    "addon_version" = "v1.10.1-eksbuild.4"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/coredns/a2c59472-562d-d731-7b10-15bff872e079"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-13T11:55:57Z"
    "id" = "eks-staging:coredns"
    "modified_at" = "2023-10-13T11:56:06Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "kube-proxy" = {
    "addon_name" = "kube-proxy"
    "addon_version" = "v1.28.2-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/kube-proxy/0ec59472-5630-6998-e269-bcb0767ca91b"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-13T11:55:57Z"
    "id" = "eks-staging:kube-proxy"
    "modified_at" = "2023-10-13T11:56:29Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "vpc-cni" = {
    "addon_name" = "vpc-cni"
    "addon_version" = "v1.15.0-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/vpc-cni/c4c59472-562f-e5cc-47d6-99b81b7d1f74"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-13T11:55:57Z"
    "id" = "eks-staging:vpc-cni"
    "modified_at" = "2023-10-13T11:56:35Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
}
cluster_arn = "arn:aws:eks:us-east-1:039454511521:cluster/eks-staging"
cluster_certificate_authority_data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJR2x5dnBqVWR1TDR3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01UTXhNVFEwTkRCYUZ3MHpNekV3TVRBeE1UUTVOREJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUQzcjkzRWYxWDlHUTdrQWdHMlFmb08xQkxIM1laR01OUGtOMTRZUzNBclFzcEpmNytQOGZlRUJXSWgKL1I3emtvQ1lpcm1SSXA3VVRGcklmaWlYQU5hVU96Rk9xU2tESDlxZ0lqR21xSFZmUm9HNWV5dHBkK253eXZ3ZwphYnc2Vzd6ZzVqNmdPOWVUb3RMNGFSRzFCQ2paM0d6OEExR2tRQ25vWklzWkN1R3VNdGRqR1cyUXN4eDJtaTllCjVOdzZHbWk3cVVYV2hHZjhBd3N1MGVHNE1Pcmw5ZThhODFLQWcxSWFra2E2L2RJL3BYSEowWjNqazZ6L0h2d3IKVkltckRQZUJhYy9JYlFFcWJvTi9pVjRDUU1oU3g5OWFFQ2VTZDBtRnlMZThIMUxxUElVUVRnbjdETjlXWkQ3cgp6NHB2MTVrREF5eGpvWmlTc0R4M3lyZmhXVU9uQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUbDRWZVFVQ0ZqN2Z3bDhKTGd3bHpjR1hyZ3lUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ2h4eW1hQVEyagpuLzh6WG5rVDgyV1lFRXVudnJQNEhpaFlrTjNFNW1VZTdQUWc0MGRYN2YrMzRaTFBHOHpxeXdGOU1zU2k4ck0zCkd3TkdBK0dqWlVnVUd0Q0FVdExvQU8rRVQzdGlxSFlLTXdsZVFvb0l3bWJsdUZzZlhFU0VYYXB0R3pFNUUyRlgKd0Z5NjUvMXgxK29ZanNFM2VBR1ZSRDBtejgrS0FDanNmMWRwYW1kMFM3R2hVQ0preWVkbk5KZUdvU3JKUG5ZeQoyWDBlclJBSEtlWDZXUy93L3ZDNWhLOXdKbHRFaWVoQjRzR2VHQXRZMXhob2V2aEJNSzl2YWNNMlNIYkh1WFdxCmEvVHhBSmQ3QmF6citKQkhub1BJSlJmU2ZqMnJ3dy9XaE9BQ1ZNS0lIc0dOQm9IQ0JZMlZhWDZQQ1N2UkNyaTkKakxkYTF5YmlRUXJnCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
cluster_endpoint = "https://59BD58F5B14FC713383F24F9B0EE3A63.gr7.us-east-1.eks.amazonaws.com"
cluster_iam_role_arn = "arn:aws:iam::039454511521:role/eks-staging-cluster-20231013114406216600000001"
cluster_iam_role_name = "eks-staging-cluster-20231013114406216600000001"
cluster_iam_role_unique_id = "AROAQSL5MCGQZESKZM77H"
cluster_identity_providers = {}
cluster_name = "eks-staging"
cluster_oidc_issuer_url = "https://oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63"
cluster_platform_version = "eks.1"
cluster_primary_security_group_id = "sg-0fc60012693b497ae"
cluster_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-044f16c76d3782fcb"
cluster_security_group_id = "sg-044f16c76d3782fcb"
cluster_status = "ACTIVE"
cluster_tls_certificate_sha1_fingerprint = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
cluster_version = "1.28"
eks_managed_node_groups = {
  "general" = {
    "autoscaling_group_schedule_arns" = {}
    "iam_role_arn" = "arn:aws:iam::039454511521:role/general-eks-node-group-20231013114406218900000003"
    "iam_role_name" = "general-eks-node-group-20231013114406218900000003"
    "iam_role_unique_id" = "AROAQSL5MCGQ3BID5TEUF"
    "launch_template_arn" = "arn:aws:ec2:us-east-1:039454511521:launch-template/lt-08c198930bd9c71ac"
    "launch_template_id" = "lt-08c198930bd9c71ac"
    "launch_template_latest_version" = 1
    "launch_template_name" = "general-2023101311535522340000000c"
    "node_group_arn" = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101311535584640000000e/50c59471-6874-f409-b1ea-f0676e1789af"
    "node_group_autoscaling_group_names" = [
      "eks-general-2023101311535584640000000e-50c59471-6874-f409-b1ea-f0676e1789af",
    ]
    "node_group_id" = "eks-staging:general-2023101311535584640000000e"
    "node_group_labels" = tomap({})
    "node_group_resources" = tolist([
      {
        "autoscaling_groups" = tolist([
          {
            "name" = "eks-general-2023101311535584640000000e-50c59471-6874-f409-b1ea-f0676e1789af"
          },
        ])
        "remote_access_security_group_id" = ""
      },
    ])
    "node_group_status" = "ACTIVE"
    "node_group_taints" = toset([])
    "platform" = "linux"
  }
}
eks_managed_node_groups_autoscaling_group_names = tolist([
  "eks-general-2023101311535584640000000e-50c59471-6874-f409-b1ea-f0676e1789af",
])
fargate_profiles = {}
kms_key_arn = "arn:aws:kms:us-east-1:039454511521:key/cb43c7ab-6fba-48c1-8412-8704afe15168"
kms_key_id = "cb43c7ab-6fba-48c1-8412-8704afe15168"
kms_key_policy = "{\"Statement\":[{\"Action\":[\"kms:Update*\",\"kms:UntagResource\",\"kms:TagResource\",\"kms:ScheduleKeyDeletion\",\"kms:Revoke*\",\"kms:Put*\",\"kms:List*\",\"kms:Get*\",\"kms:Enable*\",\"kms:Disable*\",\"kms:Describe*\",\"kms:Delete*\",\"kms:Create*\",\"kms:CancelKeyDeletion\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:user/rimvydas\"},\"Resource\":\"*\",\"Sid\":\"KeyAdministration\"},{\"Action\":[\"kms:ReEncrypt*\",\"kms:GenerateDataKey*\",\"kms:Encrypt\",\"kms:DescribeKey\",\"kms:Decrypt\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:role/eks-staging-cluster-20231013114406216600000001\"},\"Resource\":\"*\",\"Sid\":\"KeyUsage\"}],\"Version\":\"2012-10-17\"}"
node_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-073f0eb34900457c7"
node_security_group_id = "sg-073f0eb34900457c7"
oidc_provider = "oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63"
oidc_provider_arn = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63"
self_managed_node_groups = {}
self_managed_node_groups_autoscaling_group_names = tolist([])

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_policy.argocd_image_updater[0] will be created
  + resource "aws_iam_policy" "argocd_image_updater" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "eks-staging-argocd-image-updater"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:ListTagsForResource",
                          + "ecr:DescribeImageScanFindings",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.argocd_image_updater[0] will be created
  + resource "aws_iam_role" "argocd_image_updater" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63:sub" = "system:serviceaccount:kube-system:argocd-image-updater"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-staging-argocd-image-updater"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.argocd_image_updater[0] will be created
  + resource "aws_iam_role_policy_attachment" "argocd_image_updater" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-staging-argocd-image-updater"
    }

  # helm_release.argocd_image_updater[0] will be created
  + resource "helm_release" "argocd_image_updater" {
      + atomic                     = false
      + chart                      = "argocd-image-updater"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-image-updater"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.9.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.sealed_secrets[0] will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealed-secrets"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.5.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.
aws_iam_policy.argocd_image_updater[0]: Creating...
aws_iam_role.argocd_image_updater[0]: Creating...
aws_iam_policy.argocd_image_updater[0]: Creation complete after 0s [id=arn:aws:iam::039454511521:policy/eks-staging-argocd-image-updater]
aws_iam_role.argocd_image_updater[0]: Creation complete after 0s [id=eks-staging-argocd-image-updater]
aws_iam_role_policy_attachment.argocd_image_updater[0]: Creating...
aws_iam_role_policy_attachment.argocd_image_updater[0]: Creation complete after 0s [id=eks-staging-argocd-image-updater-20231013124346135200000001]
helm_release.sealed_secrets[0]: Creating...
helm_release.argocd_image_updater[0]: Creating...
helm_release.sealed_secrets[0]: Still creating... [10s elapsed]
helm_release.argocd_image_updater[0]: Still creating... [10s elapsed]
helm_release.sealed_secrets[0]: Still creating... [20s elapsed]
helm_release.sealed_secrets[0]: Creation complete after 20s [id=sealed-secrets]
helm_release.argocd_image_updater[0]: Still creating... [20s elapsed]
helm_release.argocd_image_updater[0]: Still creating... [30s elapsed]
helm_release.argocd_image_updater[0]: Creation complete after 39s [id=argocd-image-updater]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-02787dd14380096d0]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-070d2ab5d4586d980]
aws_default_security_group.this[0]: Refreshing state... [id=sg-0d335e5c6101a1d46]
aws_subnet.private[0]: Refreshing state... [id=subnet-078ed00d5361747db]
aws_subnet.intra[1]: Refreshing state... [id=subnet-0d4d0ff0f2e0236fa]
aws_subnet.intra[2]: Refreshing state... [id=subnet-07d9ea370bfe74644]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-03ceaa93f1356815d]
aws_subnet.intra[0]: Refreshing state... [id=subnet-06411f0fbac7b713f]
aws_route_table.intra[0]: Refreshing state... [id=rtb-00210cf139ab8b816]
aws_subnet.private[1]: Refreshing state... [id=subnet-019be35d8bb9cfa73]
aws_subnet.private[2]: Refreshing state... [id=subnet-0a2dce1751ff6adcd]
aws_route_table.private[0]: Refreshing state... [id=rtb-00b94f529aad8fc24]
aws_subnet.public[0]: Refreshing state... [id=subnet-0222aa8bb754c5d31]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-00b1dd80bb5f5a5ca]
aws_route_table.public[0]: Refreshing state... [id=rtb-092cdfa16c80090e1]
aws_subnet.public[1]: Refreshing state... [id=subnet-04578f066f122de24]
aws_subnet.public[2]: Refreshing state... [id=subnet-0213a1e92056659a1]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d3132a2de77af2af]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0a0d0e60852621b48]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0701feee500308be2]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-028b6724f2ff0705c]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b920c5d7742f7d88]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05dd5a9ff23d3fee9]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a6c89ffe3a60bdc2]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-092cdfa16c80090e11080289494]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02c9dc912e6541dd2]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01cdcc5a85e1dea2d]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03b23a2ca33be8327]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-01b2ddee7d8b40032]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-00b94f529aad8fc241080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = tolist([
  "rtb-00b94f529aad8fc24",
])
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-070d2ab5d4586d980"
default_route_table_id = "rtb-00b1dd80bb5f5a5ca"
default_security_group_id = "sg-0d335e5c6101a1d46"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-00b94f529aad8fc24",
]
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:039454511521:internet-gateway/igw-03ceaa93f1356815d"
igw_id = "igw-03ceaa93f1356815d"
intra_route_table_association_ids = [
  "rtbassoc-028b6724f2ff0705c",
  "rtbassoc-0a0d0e60852621b48",
  "rtbassoc-0701feee500308be2",
]
intra_route_table_ids = [
  "rtb-00210cf139ab8b816",
]
intra_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-06411f0fbac7b713f",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0d4d0ff0f2e0236fa",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-07d9ea370bfe74644",
]
intra_subnets = [
  "subnet-06411f0fbac7b713f",
  "subnet-0d4d0ff0f2e0236fa",
  "subnet-07d9ea370bfe74644",
]
intra_subnets_cidr_blocks = tolist([
  "10.0.6.0/24",
  "10.0.7.0/24",
  "10.0.8.0/24",
])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-staging"
nat_ids = [
  "eipalloc-0d3132a2de77af2af",
]
nat_public_ips = tolist([
  "35.170.48.186",
])
natgw_ids = [
  "nat-01b2ddee7d8b40032",
]
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = [
  "r-rtb-00b94f529aad8fc241080289494",
]
private_route_table_association_ids = [
  "rtbassoc-0b920c5d7742f7d88",
  "rtbassoc-05dd5a9ff23d3fee9",
  "rtbassoc-0a6c89ffe3a60bdc2",
]
private_route_table_ids = [
  "rtb-00b94f529aad8fc24",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-078ed00d5361747db",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-019be35d8bb9cfa73",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0a2dce1751ff6adcd",
]
private_subnets = [
  "subnet-078ed00d5361747db",
  "subnet-019be35d8bb9cfa73",
  "subnet-0a2dce1751ff6adcd",
]
private_subnets_cidr_blocks = tolist([
  "10.0.0.0/24",
  "10.0.1.0/24",
  "10.0.2.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-092cdfa16c80090e11080289494"
public_route_table_association_ids = [
  "rtbassoc-01cdcc5a85e1dea2d",
  "rtbassoc-03b23a2ca33be8327",
  "rtbassoc-02c9dc912e6541dd2",
]
public_route_table_ids = [
  "rtb-092cdfa16c80090e1",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0222aa8bb754c5d31",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-04578f066f122de24",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0213a1e92056659a1",
]
public_subnets = [
  "subnet-0222aa8bb754c5d31",
  "subnet-04578f066f122de24",
  "subnet-0213a1e92056659a1",
]
public_subnets_cidr_blocks = tolist([
  "10.0.3.0/24",
  "10.0.4.0/24",
  "10.0.5.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-00b94f529aad8fc24",
])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:039454511521:vpc/vpc-02787dd14380096d0"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-02787dd14380096d0"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-00b1dd80bb5f5a5ca"
vpc_owner_id = "039454511521"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>

</details>